In [1]:
L=[1,2,3,4,5]

In [6]:
from pandas import DataFrame as DF

In [3]:
Data1=DF(L)

In [4]:
Data1

   0
0  1
1  2
2  3
3  4
4  5

In [5]:
L=[(1,2,3),(4,5,6),(7,8)]

In [6]:
Data2=DF(L)

In [7]:
Data2

   0  1    2
0  1  2  3.0
1  4  5  6.0
2  7  8  NaN

In [8]:
T=([1,2,3],[4,5,6])

In [9]:
Data3=DF(T)

In [10]:
Data3

   0  1  2
0  1  2  3
1  4  5  6

In [11]:
S={(1,2,3),(4,5,6)}

In [12]:
Data4=DF(S)

In [13]:
Data4

   0  1  2
0  1  2  3
1  4  5  6

In [14]:
print(type(Data4))

<class 'pandas.core.frame.DataFrame'>

In [15]:
Data1.index

RangeIndex(start=0, stop=5, step=1)

In [16]:
Data2.index

RangeIndex(start=0, stop=3, step=1)

In [17]:
for i in Data1.index:
    print(i)

0
1
2
3
4

In [18]:
type(i)

int

In [19]:
Data1.index.dtype

dtype('int64')

In [20]:
Data2.columns

RangeIndex(start=0, stop=3, step=1)

In [21]:
for j in Data2.columns:
    print(j)

0
1
2

In [22]:
Data2.columns.dtype

dtype('int64')

In [23]:
Data1.values

array([[1],
       [2],
       [3],
       [4],
       [5]], dtype=int64)

In [24]:
Data2.values

array([[ 1.,  2.,  3.],
       [ 4.,  5.,  6.],
       [ 7.,  8., nan]])

In [25]:
type(Data2.values)

numpy.ndarray

In [28]:
Dict1={'Name':'Zachariah','empno':103,'Salary':22000}

In [29]:
Data11=DF(Dict1,index=[1])

In [30]:
Data11

        Name  empno  Salary
1  Zachariah    103   22000

In [31]:
Dict2={'Name':{'one':'Mohan','two':'Shahana','three':'Zachariah'},'empno':{'one':101,'two':102,'three':103},'Salary':{'one':14000,'two':20000,'three':22000}}

In [32]:
Data12=DF(Dict2)

In [33]:
Data12

            Name  empno  Salary
one        Mohan    101   14000
two      Shahana    102   20000
three  Zachariah    103   22000

In [4]:
Dict3={'Name':['Mohan','Shahana','Zachariah'],'empno':[101,102,103],'Salary':[14000,20000,22000]}

In [7]:
Data13=DF(Dict3)

In [8]:
Data13

        Name  empno  Salary
0      Mohan    101   14000
1    Shahana    102   20000
2  Zachariah    103   22000

In [ ]:
Data=DF()

In [2]:
Data

NameError: name 'Data' is not defined

In [ ]:
type(Data)

In [9]:
L11=[1]

In [10]:
Dat11=DF(L11)

In [11]:
Dat11

   0
0  1

In [12]:
S11={1}

In [13]:
Dat12=DF(S11)

In [14]:
Dat12

   0
0  1

In [15]:
T11=1,

In [16]:
Dat13=DF(T11)

In [17]:
Dat13

   0
0  1

In [34]:
import pandas as pd

In [36]:
DataSet1=pd.read_csv('../emp.csv')

In [37]:
DataSet1

            E_Name  E_ID    E_Desig  E_Salary
0            K.Raj   101  scientist     54000
1     Mohan Raj M.   102   engineer     50000
2            M.Ram   103  scientist     80000
3        Ram Kumar   104  scientist     66000
4  Mohan Babu K.K.   106    officer     57000
5          K.Gopal   107  scientist     50000
6      Anil Raj M.   108   engineer     62000
7         Amala P.   201  scientist     70000
8             Uma    204    officer     60000
9             Suma   206   engineer     57000

In [38]:
DataSet1.values

array([['K.Raj', 101, 'scientist', 54000],
       ['Mohan Raj M.', 102, 'engineer', 50000],
       ['M.Ram', 103, 'scientist', 80000],
       ['Ram Kumar', 104, 'scientist', 66000],
       ['Mohan Babu K.K.', 106, 'officer', 57000],
       ['K.Gopal', 107, 'scientist', 50000],
       ['Anil Raj M.', 108, 'engineer', 62000],
       ['Amala P.', 201, 'scientist', 70000],
       ['Uma ', 204, 'officer', 60000],
       ['Suma', 206, 'engineer', 57000]], dtype=object)

In [39]:
DataSet1.size

40

In [40]:
DataSet1.shape

(10, 4)

In [41]:
DataSet1.ndim

2

In [42]:
DataSet1.reshape(2,5,4)

AttributeError: 'DataFrame' object has no attribute 'reshape'

In [43]:
DataSet1.values.reshape(2,5,4)

array([[['K.Raj', 101, 'scientist', 54000],
        ['Mohan Raj M.', 102, 'engineer', 50000],
        ['M.Ram', 103, 'scientist', 80000],
        ['Ram Kumar', 104, 'scientist', 66000],
        ['Mohan Babu K.K.', 106, 'officer', 57000]],

       [['K.Gopal', 107, 'scientist', 50000],
        ['Anil Raj M.', 108, 'engineer', 62000],
        ['Amala P.', 201, 'scientist', 70000],
        ['Uma ', 204, 'officer', 60000],
        ['Suma', 206, 'engineer', 57000]]], dtype=object)

In [44]:
DataSet1.index

RangeIndex(start=0, stop=10, step=1)

In [45]:
for col in DataSet1.columns:
    print(col)

E_Name
E_ID
E_Desig
E_Salary

In [46]:
DataSet1.columns

Index(['E_Name', 'E_ID', 'E_Desig', 'E_Salary'], dtype='object')

In [47]:
DataSet1['E_Name']

0              K.Raj
1       Mohan Raj M.
2              M.Ram
3          Ram Kumar
4    Mohan Babu K.K.
5            K.Gopal
6        Anil Raj M.
7           Amala P.
8               Uma
9               Suma
Name: E_Name, dtype: object

In [48]:
DataSet1['E_ID']

0    101
1    102
2    103
3    104
4    106
5    107
6    108
7    201
8    204
9    206
Name: E_ID, dtype: int64

In [49]:
DataSet1['1']

KeyError: '1'

In [50]:
DataSet1.loc[1]

E_Name      Mohan Raj M.
E_ID                 102
E_Desig         engineer
E_Salary           50000
Name: 1, dtype: object

In [51]:
DataSet1.iloc[1]

E_Name      Mohan Raj M.
E_ID                 102
E_Desig         engineer
E_Salary           50000
Name: 1, dtype: object

In [52]:
DataSet1.iloc[:,1]

0    101
1    102
2    103
3    104
4    106
5    107
6    108
7    201
8    204
9    206
Name: E_ID, dtype: int64

In [53]:
DataSet1.loc[[1,3,5], 'E_Name']

         E_Name  E_ID    E_Desig  E_Salary
1  Mohan Raj M.   102   engineer     50000
3     Ram Kumar   104  scientist     66000
5       K.Gopal   107  scientist     50000

In [54]:
DataSet1.loc[1:3]

         E_Name  E_ID    E_Desig  E_Salary
1  Mohan Raj M.   102   engineer     50000
2         M.Ram   103  scientist     80000
3     Ram Kumar   104  scientist     66000

In [55]:
DataSet1.iloc[1,3]

50000

In [56]:
DataSet1.loc[2,'E_ID']

103

In [57]:
DataSet1.loc[2,'E_ID']=110

In [58]:
DataSet1

            E_Name  E_ID    E_Desig  E_Salary
0            K.Raj   101  scientist     54000
1     Mohan Raj M.   102   engineer     50000
2            M.Ram   110  scientist     80000
3        Ram Kumar   104  scientist     66000
4  Mohan Babu K.K.   106    officer     57000
5          K.Gopal   107  scientist     50000
6      Anil Raj M.   108   engineer     62000
7         Amala P.   201  scientist     70000
8             Uma    204    officer     60000
9             Suma   206   engineer     57000

In [59]:
DataSet1.drop('E_ID')

KeyError: "['E_ID'] not found in axis"

In [60]:
DataSet1.drop('E_ID',axis=1)

            E_Name    E_Desig  E_Salary
0            K.Raj  scientist     54000
1     Mohan Raj M.   engineer     50000
2            M.Ram  scientist     80000
3        Ram Kumar  scientist     66000
4  Mohan Babu K.K.    officer     57000
5          K.Gopal  scientist     50000
6      Anil Raj M.   engineer     62000
7         Amala P.  scientist     70000
8             Uma     officer     60000
9             Suma   engineer     57000

In [61]:
DataSet1

            E_Name  E_ID    E_Desig  E_Salary
0            K.Raj   101  scientist     54000
1     Mohan Raj M.   102   engineer     50000
2            M.Ram   110  scientist     80000
3        Ram Kumar   104  scientist     66000
4  Mohan Babu K.K.   106    officer     57000
5          K.Gopal   107  scientist     50000
6      Anil Raj M.   108   engineer     62000
7         Amala P.   201  scientist     70000
8             Uma    204    officer     60000
9             Suma   206   engineer     57000

In [62]:
DataSet1.drop('E_ID',axis=1,inplace=True)

In [63]:
DataSet1

            E_Name    E_Desig  E_Salary
0            K.Raj  scientist     54000
1     Mohan Raj M.   engineer     50000
2            M.Ram  scientist     80000
3        Ram Kumar  scientist     66000
4  Mohan Babu K.K.    officer     57000
5          K.Gopal  scientist     50000
6      Anil Raj M.   engineer     62000
7         Amala P.  scientist     70000
8             Uma     officer     60000
9             Suma   engineer     57000

In [64]:
PhoneNo=[932287278, 962287278, 914287275, 914287335, 962387278,932287278,962287278, 89287275,94287335, 962387278]

In [65]:
PhoneNo

[932287278,
 962287278,
 914287275,
 914287335,
 962387278,
 932287278,
 962287278,
 89287275,
 94287335,
 962387278]

In [66]:
DataSet1['PhoneNo']=PhoneNo

In [67]:
DataSet1

            E_Name    E_Desig  E_Salary    PhoneNo
0            K.Raj  scientist     54000  932287278
1     Mohan Raj M.   engineer     50000  962287278
2            M.Ram  scientist     80000  914287275
3        Ram Kumar  scientist     66000  914287335
4  Mohan Babu K.K.    officer     57000  962387278
5          K.Gopal  scientist     50000  932287278
6      Anil Raj M.   engineer     62000  962287278
7         Amala P.  scientist     70000   89287275
8             Uma     officer     60000   94287335
9             Suma   engineer     57000  962387278

In [68]:
DataSet1.assign(Mobile=PhoneNo)

            E_Name    E_Desig  E_Salary    PhoneNo     Mobile
0            K.Raj  scientist     54000  932287278  932287278
1     Mohan Raj M.   engineer     50000  962287278  962287278
2            M.Ram  scientist     80000  914287275  914287275
3        Ram Kumar  scientist     66000  914287335  914287335
4  Mohan Babu K.K.    officer     57000  962387278  962387278
5          K.Gopal  scientist     50000  932287278  932287278
6      Anil Raj M.   engineer     62000  962287278  962287278
7         Amala P.  scientist     70000   89287275   89287275
8             Uma     officer     60000   94287335   94287335
9             Suma   engineer     57000  962387278  962387278

In [69]:
DataSet1.assign(Mobile=PhoneNo,inplace=True)

            E_Name    E_Desig  E_Salary    PhoneNo     Mobile  inplace
0            K.Raj  scientist     54000  932287278  932287278     True
1     Mohan Raj M.   engineer     50000  962287278  962287278     True
2            M.Ram  scientist     80000  914287275  914287275     True
3        Ram Kumar  scientist     66000  914287335  914287335     True
4  Mohan Babu K.K.    officer     57000  962387278  962387278     True
5          K.Gopal  scientist     50000  932287278  932287278     True
6      Anil Raj M.   engineer     62000  962287278  962287278     True
7         Amala P.  scientist     70000   89287275   89287275     True
8             Uma     officer     60000   94287335   94287335     True
9             Suma   engineer     57000  962387278  962387278     True

In [70]:
DataSet1

            E_Name    E_Desig  E_Salary    PhoneNo
0            K.Raj  scientist     54000  932287278
1     Mohan Raj M.   engineer     50000  962287278
2            M.Ram  scientist     80000  914287275
3        Ram Kumar  scientist     66000  914287335
4  Mohan Babu K.K.    officer     57000  962387278
5          K.Gopal  scientist     50000  932287278
6      Anil Raj M.   engineer     62000  962287278
7         Amala P.  scientist     70000   89287275
8             Uma     officer     60000   94287335
9             Suma   engineer     57000  962387278

In [71]:
DataSet1.drop(1)

            E_Name    E_Desig  E_Salary    PhoneNo
0            K.Raj  scientist     54000  932287278
2            M.Ram  scientist     80000  914287275
3        Ram Kumar  scientist     66000  914287335
4  Mohan Babu K.K.    officer     57000  962387278
5          K.Gopal  scientist     50000  932287278
6      Anil Raj M.   engineer     62000  962287278
7         Amala P.  scientist     70000   89287275
8             Uma     officer     60000   94287335
9             Suma   engineer     57000  962387278

In [ ]:
import pandas as pd

In [ ]:
DataSet2=pd.read_excel('Marks.xlsx')

In [ ]:
DataSet2

In [ ]:
DataSet1=pd.read_excel('Marks.xlsx',sheet_name=0)

In [ ]:
DataSet1

In [ ]:
DataSet2=pd.read_excel('Marks.xlsx',sheet_name=1)

In [ ]:
DataSet2

In [ ]:
DataSet2.to_string()

In [ ]:
DataSet1.head()

In [ ]:
DataSet1.tail()

In [ ]:
DataSet1['Marks'].fillna(0,inplace=True)

In [ ]:
DataSet1['Marks']

In [ ]:
DataSet1['Marks'].sum()

In [ ]:
DataSet1['Marks'].mean()

In [ ]:
DataSet1['Marks'].mode()[0]

In [ ]:
import numpy as np

In [ ]:
A=np.arange(1,17).reshape(4,4)

In [ ]:
A

In [ ]:
from pandas import DataFrame as DF

In [ ]:
D_arr=DF(A,index='r1 r2 r3 r4'.split(),columns='c1 c2 c3 c4'.split())

In [ ]:
D_arr

In [ ]:
B=np.arange(21,37).reshape(4,4)

In [ ]:
B

In [ ]:
D_arr2=DF(B,index='r1 r2 r3 r4'.split(),columns='c1 c2 c3 c4'.split())

In [ ]:
D_arr2

In [ ]:
D_arr+D_arr2

In [ ]:
D_arr.add(D_arr2)

In [ ]:
D_arr-D_arr2

In [ ]:
D_arr*D_arr2

In [ ]:
D_arr/D_arr2

In [ ]:
D_arr.values@D_arr2.values

In [ ]:
D_arr.loc['r1']

In [ ]:
D_arr.to_excel('Samp3.xlsx')

In [ ]:
D_arr.to_excel('Samp4.xlsx',index=False)

In [ ]:
D_arr

In [ ]:
New_row={'c1':10,'c2':20,'c3':30,'c4':40}

In [ ]:
D_arr=D_arr.add(New_row)

In [ ]:
D_arr

In [ ]:
D_arr_new=pd.concat([D_arr,D_arr2],ignore_index=True)

In [ ]:
D_arr_new